<a href="https://colab.research.google.com/github/PashkovskaX/programowanie_api_mgr/blob/main/zadanie_domowe_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import datetime as DT

MAIN_DATA = pd.read_csv("/train.csv")

df = MAIN_DATA.copy()

In [ ]:
df[["Name","Age","Sex"]]

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

In [ ]:
df["Age"].median()

28.0

In [ ]:
df["Sex"] = [elem.replace('female', '1') for elem in df["Sex"]]
df["Sex"] = [elem.replace('male', '0') for elem in df["Sex"]]

#df["Sex"] = [elem.replace(['female', 'male'], ['1','0']) for elem in df["Sex"]]

#df["Sex"] = df["Sex"].replace(["female", "male"], ["1", "0"])

In [ ]:
values = df['Sex'].value_counts()
print(values)

0    577
1    314
Name: Sex, dtype: int64

In [ ]:
numeric_column = pd.Series(df["Age"])
age = pd.to_numeric(numeric_column)
titanic_year = 1912
dob = (titanic_year - age)
#print(dob)

df['Date of birth'] = dob
print(df[['Name','Sex','Age','Date of birth']])

                                                  Name Sex   Age  Date of birth
0                              Braund, Mr. Owen Harris   0  22.0         1890.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   1  38.0         1874.0
2                               Heikkinen, Miss. Laina   1  26.0         1886.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   1  35.0         1877.0
4                             Allen, Mr. William Henry   0  35.0         1877.0
..                                                 ...  ..   ...            ...
886                              Montvila, Rev. Juozas   0  27.0         1885.0
887                       Graham, Miss. Margaret Edith   1  19.0         1893.0
888           Johnston, Miss. Catherine Helen "Carrie"   1   NaN            NaN
889                              Behr, Mr. Karl Howell   0  26.0         1886.0
890                                Dooley, Mr. Patrick   0  32.0         1880.0

[891 rows x 4 columns]